[Ability.A_deviation_Buff H7BaseBuff]
mName="魔法偏转"
mTooltip="当此单位受到魔法类型敌方生物的伤害时，它会向攻击者施放%spell1.name，造成%d %icon_prime点源力伤害并移除目标身上的一个正面效果。"

[Ability.A_essance_Buff H7BaseBuff]
mName="魔法增幅"
mTooltip="此生物使战场上所有友方魔法生物的最终伤害提高%stat1。"

[Ability.A_PiercingShot H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法偏转"
mTooltip="当此单位受到魔法类型敌方生物的伤害时，它会向攻击者施放%spell1.name，造成%d %icon_prime点源力伤害并移除目标身上的一个正面效果。"

[Ability.A_purification_magique H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法净化"
mTooltip="此生物在其回合开始时驱散所有友方魔法类型生物身上的一个随机负面效果。"

[Creature.A_CreatureAcademy_lv1 H7Creature]
mName="精神元素"
mLore="在最初的几堂课中，灵俑家族未来的法师们有必要了解精神元素的本质及其行为。这些调皮的生物被认为是第七龙好奇心智的具现化，总是渴望学习新事物，但对大多数白银联盟的法师来说，它们是无尽烦恼的源泉。格雷姆林与物质世界和魔法位面紧密相连，喜欢改变法术的结构，这有时会导致意想不到的结果。"

[Creature.A_CreatureAcademy_lv2 H7Creature]
mName="精神秘法师"
mLore="对于普通人来说，伴随法师的精神秘法师看起来像一只奇特的宠物，但只有主人才知道其宠物的真正能力。训练秘法师需要极大的耐心，这就是为什么只有少数法师愿意冒险花时间去发现这些来自魔法位面的叛逆居民潜力。当精神秘法师过度的好奇心被成功驾驭并引导到正确方向时，它将成为任何法师研究魔法奥秘的宝贵助手。"

Patch 1.30_bug fix

[Ability.A_essance_magique H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法增幅"
mTooltip="此生物使战场上所有友方魔法生物的最终伤害提高%buff1.buff.stat1。"